# (1). pandas 기본 API, 데이터 변환
---

## 개요
---

* Index: 개별 데이터를 고유하게 식별하는 Key값, DF와 S모두 Index를 Key값으로 갖는다.

* DataFrame: 2차원 데이터(행,열)을 담는 데이터 구조체이자 pandas의 핵심 객체

* Series: 칼럼(열)이 하나뿐인 데이터 구조체

#### ★DF와 Series의 차이점: Series는 칼럼이 하나뿐이고, DF는 칼럼이 여러 개이다. 즉 DF는 여러 개의 S로 이뤄졌다고 이해해도 됨.

## 1. 파일 불러오기 및 기본 API
---

#### 사용 데이터: 캐글 타이타닉 https://www.kaggle.com/c/titanic/data

In [1]:
import pandas as pd

titanic_df = pd.read_csv(r'data\titanic_train.csv')

print('titanic 변수 타입: ',type(titanic_df))

titanic_df

titanic 변수 타입:  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

표의 맨 왼쪽에 있는 값이 Index이다.

### head() - 맨 앞 n개의 로우 반환하기
---
디폴트값은 5개

In [2]:
#맨 앞 n개의 로우를 반환하기 (디폴트는 5개)
titanic_df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

### shape - 행과 열 크기 알아보기
---

In [3]:
# DF의 행과 열 크기 알아보기
print('DataFrame 크기: ',titanic_df.shape)

DataFrame 크기:  (891, 12)

### info() - 메타데이터 확인하기
---

In [4]:
#DF의 메타데이터 확인하기
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe() - 숫자형 칼럼들의 개략적 데이터 분포도 확인
---
오직 숫자형(int,float등)만 표시되며, np분포, 평균, 최대, 최솟값 표시
* count: Not null 데이터 수
* mean: 평균
* std: 표준편차
* 25~75%: 각 값의 n%

In [5]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 특정 칼럼의 분포도 살펴보기
---
df객체.['칼럼명'] 으로 조회 가능

In [6]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

print('\nindex ','value')
titanic_pclass.head()

<class 'pandas.core.series.Series'>

index  value

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

### value_counts() - 특정 칼럼의 값별 데이터 건수
---

* 인덱스는 고유성이 보장된다면 의미 있는 데이터값 할당이 가능하다. (val_cnt처럼)
* 인덱스는 숫자형뿐만 아니라 문자열도 가능하다.
* 모든 인덱스에는 고유성이 보장되어야 한다.

In [7]:
val_cnt = titanic_df['Pclass'].value_counts()
print('많은 건수 순으로 정렬한다.')
print('index','value')
print(val_cnt)

많은 건수 순으로 정렬한다.
index value
3    491
1    216
2    184
Name: Pclass, dtype: int64

## 2. ndarray, list, 딕셔너리를 DataFrame으로 변환하기
---

### 2-1. 1차원 데이터를 DataFrame으로 변환하기
---

In [8]:
import numpy as np

#칼럼명 리스트
col_name = ['num']
#데이터 리스트
data_list = [1,2,3]

#넘파이 ndarray 생성
arr = np.array(data_list)
print('arr shape:',arr.shape)

#리스트를 이용해 DataFrame 생성
df_list = pd.DataFrame(data_list,columns=col_name)
print('1차원 리스트로 만든 DataFrame:\n',df_list)

#넘파이 ndarray를 이용해 DataFrame 생성
df_arr = pd.DataFrame(arr,columns=col_name)
print('1차원 ndarray로 만든 DataFrame:\n',df_arr)

arr shape: (3,)
1차원 리스트로 만든 DataFrame:
    num
0    1
1    2
2    3
1차원 ndarray로 만든 DataFrame:
    num
0    1
1    2
2    3

### 2-2. 2차원 데이터를 DataFrame으로 변환하기
---

(2,3) 형태의 데이터 기준

In [9]:
#칼럼명 리스트
col_name = ['num1','num2','num3']
#데이터 리스트
data_list = [[1,2,3],
            [11,12,13]]

#넘파이 ndarray 생성
arr = np.array(data_list)
print('arr shape:',arr.shape)

#리스트를 이용해 DataFrame 생성
df_list = pd.DataFrame(data_list,columns=col_name)
print('2차원 리스트로 만든 DataFrame:\n',df_list)

#넘파이 ndarray를 이용해 DataFrame 생성
df_arr = pd.DataFrame(arr,columns=col_name)
print('2차원 ndarray로 만든 DataFrame:\n',df_arr)

arr shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    num1  num2  num3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    num1  num2  num3
0     1     2     3
1    11    12    13

### 2-3. 딕셔너리를 DataFrame으로 변환하기
---

In [10]:
dict = {'num1':[1,11],'num2':[2,12],'num3':[3,13]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n',df_dict)

딕셔너리로 만든 DataFrame:
    num1  num2  num3
0     1     2     3
1    11    12    13

## 3. DataFrame을 ndarray, list, 딕셔너리로 변환하기
---

### 3-1. DataFrame을 ndarray로 변환하기 (★)
---
values를 이용하여 변환한다. (자주 쓰임)

In [11]:
arr = df_dict.values
print('df_dict.values 타입:',type(arr))
print('df_dict.values shape',arr.shape)
print(arr)

df_dict.values 타입: <class 'numpy.ndarray'>
df_dict.values shape (2, 3)
[[ 1  2  3]
 [11 12 13]]

### 3-2. DataFrame을 리스트, 딕셔너리로 변환하기
---

#### 리스트로 변환하기
---
1. values를 이용하여 ndarray로 변환
2. ndarray에 tolist() 호출

#### 딕셔너리로 변환하기
---
1. DataFrame의 to_dict() 메소드 호출
2. 이 때 인자로 'list' 입력하면 딕셔너리값이 리스트형으로 반환된다.

In [12]:
#DataFrame -> 리스트 변환
data_list = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:',type(data_list))
print(data_list)

#DataFrame -> 딕셔너리 변환
dict = df_dict.to_dict('list')
print('\ndf_dict.to_dict() 타입',type(dict))
print(dict)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 12, 13]]

df_dict.to_dict() 타입 <class 'dict'>
{'num1': [1, 11], 'num2': [2, 12], 'num3': [3, 13]}